Model: "model_16"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_16 (InputLayer)          [(None, 11, None, 1  0           []                               
                                )]                                                                
                                                                                                  
 gaussian_noise_5 (GaussianNois  (None, 11, None, 1)  0          ['input_16[0][0]']               
 e)                                                                                               
                                                                                                  
 zero_padding2d_40 (ZeroPadding  (None, 11, None, 1)  0          ['gaussian_noise_5[0][0]']       
 2D)                                                                                              
                                                                                                  
 conv2d_60 (Conv2D)             (None, 7, None, 16)  416         ['zero_padding2d_40[0][0]']      
                                                                                                  
 conv2d_61 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_60[0][0]']              
                                                                                                  
 conv2d_62 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_61[0][0]']              
                                                                                                  
 conv2d_63 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_62[0][0]']              
                                                                                                  
 zero_padding2d_41 (ZeroPadding  (None, 7, None, 16)  0          ['conv2d_63[0][0]']              
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_10 (SpatialD  (None, 7, None, 16)  0          ['zero_padding2d_41[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_64 (Conv2D)             (None, 5, None, 32)  4640        ['spatial_dropout2d_10[0][0]']   
                                                                                                  
 conv2d_65 (Conv2D)             (None, 5, None, 32)  9248        ['conv2d_64[0][0]']              
                                                                                                  
 conv2d_66 (Conv2D)             (None, 5, None, 32)  9248        ['conv2d_65[0][0]']              
                                                                                                  
 zero_padding2d_42 (ZeroPadding  (None, 5, None, 32)  0          ['conv2d_66[0][0]']              
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_11 (SpatialD  (None, 5, None, 32)  0          ['zero_padding2d_42[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_67 (Conv2D)             (None, 3, None, 64)  18496       ['spatial_dropout2d_11[0][0]']   
                                                                                                  
 conv2d_68 (Conv2D)             (None, 3, None, 64)  36928       ['conv2d_67[0][0]']              
                                                                                                  
 conv2d_69 (Conv2D)             (None, 3, None, 64)  36928       ['conv2d_68[0][0]']              
                                                                                                  
 zero_padding2d_43 (ZeroPadding  (None, 3, None, 64)  0          ['conv2d_69[0][0]']              
 2D)                                                                                              
                                                                                                  
 conv2d_70 (Conv2D)             (None, 1, None, 32)  18464       ['zero_padding2d_43[0][0]']      
                                                                                                  
 conv2d_71 (Conv2D)             (None, 1, None, 16)  4624        ['conv2d_70[0][0]']              
                                                                                                  
 reshape_15 (Reshape)           (None, None, 16)     0           ['conv2d_71[0][0]']              
                                                                                                  
 ann_decoder_0 (Sequential)     (None, None, 3)      3747        ['reshape_15[0][0]']             
                                                                                                  
 Reconstruction (Functional)    (None, 11, None, 1)  184689      ['reshape_15[0][0]']             
                                                                                                  
==================================================================================================
Total params: 346,676
Trainable params: 346,676
Non-trainable params: 0
__________________________________________________________________________________________________
