Model: "model_15"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_16 (InputLayer)       [(None, 11, None, 1)]     0         
                                                                 
 gaussian_noise_5 (GaussianN  (None, 11, None, 1)      0         
 oise)                                                           
                                                                 
 zero_padding2d_40 (ZeroPadd  (None, 11, None, 1)      0         
 ing2D)                                                          
                                                                 
 conv2d_60 (Conv2D)          (None, 7, None, 16)       416       
                                                                 
 conv2d_61 (Conv2D)          (None, 7, None, 16)       6416      
                                                                 
 conv2d_62 (Conv2D)          (None, 7, None, 16)       6416      
                                                                 
 conv2d_63 (Conv2D)          (None, 7, None, 16)       6416      
                                                                 
 zero_padding2d_41 (ZeroPadd  (None, 7, None, 16)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_10 (Spati  (None, 7, None, 16)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_64 (Conv2D)          (None, 5, None, 32)       4640      
                                                                 
 conv2d_65 (Conv2D)          (None, 5, None, 32)       9248      
                                                                 
 conv2d_66 (Conv2D)          (None, 5, None, 32)       9248      
                                                                 
 zero_padding2d_42 (ZeroPadd  (None, 5, None, 32)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_11 (Spati  (None, 5, None, 32)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_67 (Conv2D)          (None, 3, None, 64)       18496     
                                                                 
 conv2d_68 (Conv2D)          (None, 3, None, 64)       36928     
                                                                 
 conv2d_69 (Conv2D)          (None, 3, None, 64)       36928     
                                                                 
 zero_padding2d_43 (ZeroPadd  (None, 3, None, 64)      0         
 ing2D)                                                          
                                                                 
 conv2d_70 (Conv2D)          (None, 1, None, 32)       18464     
                                                                 
 conv2d_71 (Conv2D)          (None, 1, None, 16)       4624      
                                                                 
 reshape_15 (Reshape)        (None, None, 16)          0         
                                                                 
=================================================================
Total params: 158,240
Trainable params: 158,240
Non-trainable params: 0
_________________________________________________________________
