Model: "model_19"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_19 (InputLayer)          [(None, 11, None, 1  0           []                               
                                )]                                                                
                                                                                                  
 gaussian_noise_6 (GaussianNois  (None, 11, None, 1)  0          ['input_19[0][0]']               
 e)                                                                                               
                                                                                                  
 zero_padding2d_48 (ZeroPadding  (None, 11, None, 1)  0          ['gaussian_noise_6[0][0]']       
 2D)                                                                                              
                                                                                                  
 conv2d_72 (Conv2D)             (None, 7, None, 16)  416         ['zero_padding2d_48[0][0]']      
                                                                                                  
 conv2d_73 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_72[0][0]']              
                                                                                                  
 conv2d_74 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_73[0][0]']              
                                                                                                  
 conv2d_75 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_74[0][0]']              
                                                                                                  
 zero_padding2d_49 (ZeroPadding  (None, 7, None, 16)  0          ['conv2d_75[0][0]']              
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_12 (SpatialD  (None, 7, None, 16)  0          ['zero_padding2d_49[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_76 (Conv2D)             (None, 5, None, 32)  4640        ['spatial_dropout2d_12[0][0]']   
                                                                                                  
 conv2d_77 (Conv2D)             (None, 5, None, 32)  9248        ['conv2d_76[0][0]']              
                                                                                                  
 conv2d_78 (Conv2D)             (None, 5, None, 32)  9248        ['conv2d_77[0][0]']              
                                                                                                  
 zero_padding2d_50 (ZeroPadding  (None, 5, None, 32)  0          ['conv2d_78[0][0]']              
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_13 (SpatialD  (None, 5, None, 32)  0          ['zero_padding2d_50[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_79 (Conv2D)             (None, 3, None, 64)  18496       ['spatial_dropout2d_13[0][0]']   
                                                                                                  
 conv2d_80 (Conv2D)             (None, 3, None, 64)  36928       ['conv2d_79[0][0]']              
                                                                                                  
 conv2d_81 (Conv2D)             (None, 3, None, 64)  36928       ['conv2d_80[0][0]']              
                                                                                                  
 zero_padding2d_51 (ZeroPadding  (None, 3, None, 64)  0          ['conv2d_81[0][0]']              
 2D)                                                                                              
                                                                                                  
 conv2d_82 (Conv2D)             (None, 1, None, 32)  18464       ['zero_padding2d_51[0][0]']      
                                                                                                  
 conv2d_83 (Conv2D)             (None, 1, None, 16)  4624        ['conv2d_82[0][0]']              
                                                                                                  
 reshape_18 (Reshape)           (None, None, 16)     0           ['conv2d_83[0][0]']              
                                                                                                  
 ann_decoder_0 (Sequential)     (None, None, 3)      3747        ['reshape_18[0][0]']             
                                                                                                  
 Reconstruction (Functional)    (None, 11, None, 1)  184689      ['reshape_18[0][0]']             
                                                                                                  
==================================================================================================
Total params: 346,676
Trainable params: 346,676
Non-trainable params: 0
__________________________________________________________________________________________________
