Model: "model_18"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_19 (InputLayer)       [(None, 11, None, 1)]     0         
                                                                 
 gaussian_noise_6 (GaussianN  (None, 11, None, 1)      0         
 oise)                                                           
                                                                 
 zero_padding2d_48 (ZeroPadd  (None, 11, None, 1)      0         
 ing2D)                                                          
                                                                 
 conv2d_72 (Conv2D)          (None, 7, None, 16)       416       
                                                                 
 conv2d_73 (Conv2D)          (None, 7, None, 16)       6416      
                                                                 
 conv2d_74 (Conv2D)          (None, 7, None, 16)       6416      
                                                                 
 conv2d_75 (Conv2D)          (None, 7, None, 16)       6416      
                                                                 
 zero_padding2d_49 (ZeroPadd  (None, 7, None, 16)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_12 (Spati  (None, 7, None, 16)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_76 (Conv2D)          (None, 5, None, 32)       4640      
                                                                 
 conv2d_77 (Conv2D)          (None, 5, None, 32)       9248      
                                                                 
 conv2d_78 (Conv2D)          (None, 5, None, 32)       9248      
                                                                 
 zero_padding2d_50 (ZeroPadd  (None, 5, None, 32)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_13 (Spati  (None, 5, None, 32)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_79 (Conv2D)          (None, 3, None, 64)       18496     
                                                                 
 conv2d_80 (Conv2D)          (None, 3, None, 64)       36928     
                                                                 
 conv2d_81 (Conv2D)          (None, 3, None, 64)       36928     
                                                                 
 zero_padding2d_51 (ZeroPadd  (None, 3, None, 64)      0         
 ing2D)                                                          
                                                                 
 conv2d_82 (Conv2D)          (None, 1, None, 32)       18464     
                                                                 
 conv2d_83 (Conv2D)          (None, 1, None, 16)       4624      
                                                                 
 reshape_18 (Reshape)        (None, None, 16)          0         
                                                                 
=================================================================
Total params: 158,240
Trainable params: 158,240
Non-trainable params: 0
_________________________________________________________________
