Model: "model_27"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_28 (InputLayer)       [(None, 11, None, 1)]     0         
                                                                 
 gaussian_noise_9 (GaussianN  (None, 11, None, 1)      0         
 oise)                                                           
                                                                 
 zero_padding2d_72 (ZeroPadd  (None, 11, None, 1)      0         
 ing2D)                                                          
                                                                 
 conv2d_108 (Conv2D)         (None, 7, None, 16)       416       
                                                                 
 conv2d_109 (Conv2D)         (None, 7, None, 16)       6416      
                                                                 
 conv2d_110 (Conv2D)         (None, 7, None, 16)       6416      
                                                                 
 conv2d_111 (Conv2D)         (None, 7, None, 16)       6416      
                                                                 
 zero_padding2d_73 (ZeroPadd  (None, 7, None, 16)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_18 (Spati  (None, 7, None, 16)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_112 (Conv2D)         (None, 5, None, 32)       4640      
                                                                 
 conv2d_113 (Conv2D)         (None, 5, None, 32)       9248      
                                                                 
 conv2d_114 (Conv2D)         (None, 5, None, 32)       9248      
                                                                 
 zero_padding2d_74 (ZeroPadd  (None, 5, None, 32)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_19 (Spati  (None, 5, None, 32)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_115 (Conv2D)         (None, 3, None, 64)       18496     
                                                                 
 conv2d_116 (Conv2D)         (None, 3, None, 64)       36928     
                                                                 
 conv2d_117 (Conv2D)         (None, 3, None, 64)       36928     
                                                                 
 zero_padding2d_75 (ZeroPadd  (None, 3, None, 64)      0         
 ing2D)                                                          
                                                                 
 conv2d_118 (Conv2D)         (None, 1, None, 32)       18464     
                                                                 
 conv2d_119 (Conv2D)         (None, 1, None, 16)       4624      
                                                                 
 reshape_27 (Reshape)        (None, None, 16)          0         
                                                                 
=================================================================
Total params: 158,240
Trainable params: 158,240
Non-trainable params: 0
_________________________________________________________________
