Model: "model_30"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_31 (InputLayer)       [(None, 11, None, 1)]     0         
                                                                 
 gaussian_noise_10 (Gaussian  (None, 11, None, 1)      0         
 Noise)                                                          
                                                                 
 zero_padding2d_80 (ZeroPadd  (None, 11, None, 1)      0         
 ing2D)                                                          
                                                                 
 conv2d_120 (Conv2D)         (None, 7, None, 16)       416       
                                                                 
 conv2d_121 (Conv2D)         (None, 7, None, 16)       6416      
                                                                 
 conv2d_122 (Conv2D)         (None, 7, None, 16)       6416      
                                                                 
 conv2d_123 (Conv2D)         (None, 7, None, 16)       6416      
                                                                 
 zero_padding2d_81 (ZeroPadd  (None, 7, None, 16)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_20 (Spati  (None, 7, None, 16)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_124 (Conv2D)         (None, 5, None, 32)       4640      
                                                                 
 conv2d_125 (Conv2D)         (None, 5, None, 32)       9248      
                                                                 
 conv2d_126 (Conv2D)         (None, 5, None, 32)       9248      
                                                                 
 zero_padding2d_82 (ZeroPadd  (None, 5, None, 32)      0         
 ing2D)                                                          
                                                                 
 spatial_dropout2d_21 (Spati  (None, 5, None, 32)      0         
 alDropout2D)                                                    
                                                                 
 conv2d_127 (Conv2D)         (None, 3, None, 64)       18496     
                                                                 
 conv2d_128 (Conv2D)         (None, 3, None, 64)       36928     
                                                                 
 conv2d_129 (Conv2D)         (None, 3, None, 64)       36928     
                                                                 
 zero_padding2d_83 (ZeroPadd  (None, 3, None, 64)      0         
 ing2D)                                                          
                                                                 
 conv2d_130 (Conv2D)         (None, 1, None, 32)       18464     
                                                                 
 conv2d_131 (Conv2D)         (None, 1, None, 16)       4624      
                                                                 
 reshape_30 (Reshape)        (None, None, 16)          0         
                                                                 
=================================================================
Total params: 158,240
Trainable params: 158,240
Non-trainable params: 0
_________________________________________________________________
