Model: "model_31"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_31 (InputLayer)          [(None, 11, None, 1  0           []                               
                                )]                                                                
                                                                                                  
 gaussian_noise_10 (GaussianNoi  (None, 11, None, 1)  0          ['input_31[0][0]']               
 se)                                                                                              
                                                                                                  
 zero_padding2d_80 (ZeroPadding  (None, 11, None, 1)  0          ['gaussian_noise_10[0][0]']      
 2D)                                                                                              
                                                                                                  
 conv2d_120 (Conv2D)            (None, 7, None, 16)  416         ['zero_padding2d_80[0][0]']      
                                                                                                  
 conv2d_121 (Conv2D)            (None, 7, None, 16)  6416        ['conv2d_120[0][0]']             
                                                                                                  
 conv2d_122 (Conv2D)            (None, 7, None, 16)  6416        ['conv2d_121[0][0]']             
                                                                                                  
 conv2d_123 (Conv2D)            (None, 7, None, 16)  6416        ['conv2d_122[0][0]']             
                                                                                                  
 zero_padding2d_81 (ZeroPadding  (None, 7, None, 16)  0          ['conv2d_123[0][0]']             
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_20 (SpatialD  (None, 7, None, 16)  0          ['zero_padding2d_81[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_124 (Conv2D)            (None, 5, None, 32)  4640        ['spatial_dropout2d_20[0][0]']   
                                                                                                  
 conv2d_125 (Conv2D)            (None, 5, None, 32)  9248        ['conv2d_124[0][0]']             
                                                                                                  
 conv2d_126 (Conv2D)            (None, 5, None, 32)  9248        ['conv2d_125[0][0]']             
                                                                                                  
 zero_padding2d_82 (ZeroPadding  (None, 5, None, 32)  0          ['conv2d_126[0][0]']             
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_21 (SpatialD  (None, 5, None, 32)  0          ['zero_padding2d_82[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_127 (Conv2D)            (None, 3, None, 64)  18496       ['spatial_dropout2d_21[0][0]']   
                                                                                                  
 conv2d_128 (Conv2D)            (None, 3, None, 64)  36928       ['conv2d_127[0][0]']             
                                                                                                  
 conv2d_129 (Conv2D)            (None, 3, None, 64)  36928       ['conv2d_128[0][0]']             
                                                                                                  
 zero_padding2d_83 (ZeroPadding  (None, 3, None, 64)  0          ['conv2d_129[0][0]']             
 2D)                                                                                              
                                                                                                  
 conv2d_130 (Conv2D)            (None, 1, None, 32)  18464       ['zero_padding2d_83[0][0]']      
                                                                                                  
 conv2d_131 (Conv2D)            (None, 1, None, 16)  4624        ['conv2d_130[0][0]']             
                                                                                                  
 reshape_30 (Reshape)           (None, None, 16)     0           ['conv2d_131[0][0]']             
                                                                                                  
 ann_decoder_0 (Sequential)     (None, None, 3)      3747        ['reshape_30[0][0]']             
                                                                                                  
 Reconstruction (Functional)    (None, 11, None, 1)  184689      ['reshape_30[0][0]']             
                                                                                                  
==================================================================================================
Total params: 346,676
Trainable params: 346,676
Non-trainable params: 0
__________________________________________________________________________________________________
