Model: "model_22"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_22 (InputLayer)          [(None, 11, None, 1  0           []                               
                                )]                                                                
                                                                                                  
 gaussian_noise_7 (GaussianNois  (None, 11, None, 1)  0          ['input_22[0][0]']               
 e)                                                                                               
                                                                                                  
 zero_padding2d_56 (ZeroPadding  (None, 11, None, 1)  0          ['gaussian_noise_7[0][0]']       
 2D)                                                                                              
                                                                                                  
 conv2d_84 (Conv2D)             (None, 7, None, 16)  416         ['zero_padding2d_56[0][0]']      
                                                                                                  
 conv2d_85 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_84[0][0]']              
                                                                                                  
 conv2d_86 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_85[0][0]']              
                                                                                                  
 conv2d_87 (Conv2D)             (None, 7, None, 16)  6416        ['conv2d_86[0][0]']              
                                                                                                  
 zero_padding2d_57 (ZeroPadding  (None, 7, None, 16)  0          ['conv2d_87[0][0]']              
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_14 (SpatialD  (None, 7, None, 16)  0          ['zero_padding2d_57[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_88 (Conv2D)             (None, 5, None, 32)  4640        ['spatial_dropout2d_14[0][0]']   
                                                                                                  
 conv2d_89 (Conv2D)             (None, 5, None, 32)  9248        ['conv2d_88[0][0]']              
                                                                                                  
 conv2d_90 (Conv2D)             (None, 5, None, 32)  9248        ['conv2d_89[0][0]']              
                                                                                                  
 zero_padding2d_58 (ZeroPadding  (None, 5, None, 32)  0          ['conv2d_90[0][0]']              
 2D)                                                                                              
                                                                                                  
 spatial_dropout2d_15 (SpatialD  (None, 5, None, 32)  0          ['zero_padding2d_58[0][0]']      
 ropout2D)                                                                                        
                                                                                                  
 conv2d_91 (Conv2D)             (None, 3, None, 64)  18496       ['spatial_dropout2d_15[0][0]']   
                                                                                                  
 conv2d_92 (Conv2D)             (None, 3, None, 64)  36928       ['conv2d_91[0][0]']              
                                                                                                  
 conv2d_93 (Conv2D)             (None, 3, None, 64)  36928       ['conv2d_92[0][0]']              
                                                                                                  
 zero_padding2d_59 (ZeroPadding  (None, 3, None, 64)  0          ['conv2d_93[0][0]']              
 2D)                                                                                              
                                                                                                  
 conv2d_94 (Conv2D)             (None, 1, None, 32)  18464       ['zero_padding2d_59[0][0]']      
                                                                                                  
 conv2d_95 (Conv2D)             (None, 1, None, 16)  4624        ['conv2d_94[0][0]']              
                                                                                                  
 reshape_21 (Reshape)           (None, None, 16)     0           ['conv2d_95[0][0]']              
                                                                                                  
 ann_decoder_0 (Sequential)     (None, None, 3)      3747        ['reshape_21[0][0]']             
                                                                                                  
 Reconstruction (Functional)    (None, 11, None, 1)  184689      ['reshape_21[0][0]']             
                                                                                                  
==================================================================================================
Total params: 346,676
Trainable params: 346,676
Non-trainable params: 0
__________________________________________________________________________________________________
